Hi @bryantbiggs 

I think that the new feature to create security groups for vpc endpoints is not working.

```
module "vpc_endpoints" {
  source   = "terraform-aws-modules/vpc/aws//modules/vpc-endpoints"
  version  = "5.1.0"
  vpc_id   = data.aws_vpc.vpc_datasource.id
  endpoints = {
    logs = {
      create              = false
      service             = "logs"
      private_dns_enabled = true
      create_security_group      = true
      security_group_description = "security group for cloudwatchlogs-vpc-endpoint"
      security_group_name_prefix = "cloudwatchlogs-vpc-endpoint-sg"
      security_group_rules  = {
      ingress = {
        from_port   = 443
        to_port     = 443
        protocol    = "tcp"
        description = "from 1.2.3.4/5:443"
        cidr_blocks = "0.0.0.0/0"
      }
      egress = {
        from_port   = -1
        to_port     = -1
        protocol    = "-1"
        description = "Allow all outgoing traffic"
        cidr_blocks = "0.0.0.0/0"
      }
    }
      subnet_ids = [for subnet_ids in data.aws_subnet.example : subnet_ids.id]
      tags       = { Name = "cloudwatchlogs-vpc-endpoint" }
    }
  }
}
```

This is my ouput in the console:

`  # module.vpc_endpoints.aws_vpc_endpoint.this["logs"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.logs"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-0120e7db456cdea23",
          + "subnet-01ee56dc688436975",
          + "subnet-082e2b84b329c0e7b",
          + "subnet-0b7088527fc8e9850",
          + "subnet-0c970355eb251ebc1",
          + "subnet-0df47a8ae0643cfbe",
        ]
      + tags                  = {
          + "Name" = "cloudwatchlogs-vpc-endpoint"
        }
      + tags_all              = {
          + "Name" = "cloudwatchlogs-vpc-endpoint"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-07bd49a034b4dfc44"

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.`